//Послідовність Фібоначіутворюється так: перший і другий члени послідовності дорівнюють 1, кожен наступний дорівнює сумі двох попередніх (1, 1, 2, 3, 5, 8, 13,..). 
//Дано натуральне число n(n≥ 3). Отримати перші 𝑛 членів послідовності Фібоначі.

#include <iostream>

using namespace std;

int main() {
	//Створюємо масив послідовності Фібоначчі
	int fib[100];
	//Додаємо змінну n
	int n;
	cout << "Enter n" << endl;
	//Робимо введення для значення n (вводимо значення >=3)
	cin >> n;
	fib[0] = 1;
	fib[1] = 1;
	//Створюємо цикл, що вираховує числа послідовності
		for (int i = 2; i < n; i++) {
			fib[i] = fib[i - 1] + fib[i - 2];
		}
		cout << "Fibonacci" << endl;
		for (int i = 0; i < n; i++) {
			cout << fib[i] << " " << endl;
		}

	return 0;
}
